{"children": [{"name": "unrest, conflicts and war - crisis", "children": [{"children": [{"tags": ["some", "dummy", "tags"], "summary": ["UNDER NO CIRCUMSTANCES, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE, SHALL HASBRO BE LIABLE FOR ANY SPECIAL OR CONSEQUENTIAL DAMAGES THAT RESULT FROM THE USE OF, OR THE INABILITY TO USE, SITE OR ANY DOWNLOADED MATERIALS, EVEN IF HASBRO OR ITS REPRESENTATIVE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.", "IN NO EVENT SHALL HASBRO'S TOTAL LIABILITY TO YOU FROM ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT, OR OTHERWISE) EXCEED THE AMOUNT YOU PAID TO HASBRO, IF ANY, FOR PRODUCTS PURCHASED ON THIS SITE."], "name": "UNDER NO CIRCUMSTANCES, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE, SHALL HASBRO BE LIABLE FOR ANY SPECIAL OR CONSEQUENTIAL DAMAGES THAT RESULT FROM THE USE OF, OR THE INABILITY TO USE, SITE OR ANY DOWNLOADED MATERIALS, EVEN IF HASBRO OR ITS REPRESENTATIVE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN NO EVENT SHALL HASBRO'S TOTAL LIABILITY TO YOU FROM ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT, OR OTHERWISE) EXCEED THE AMOUNT YOU PAID TO HASBRO, IF ANY, FOR PRODUCTS PURCHASED ON THIS SITE.", "size": 10480000}], "name": "#HASBRO", "size": 140000}]}, {"name": "interior policy - data protection", "children": [{"children": [{"tags": ["some", "dummy", "tags"], "summary": ["You may terminate this Agreement at any time by no longer using this web site, provided that all prior uses of this web site shall be governed by this Agreement.", "Upon any termination of this Agreement by either you or Hasbro, you must promptly destroy all materials downloaded or otherwise obtained from this web site, as well as all copies of such materials, whether made under the terms of this Agreement or otherwise."], "name": "This Agreement is effective unless and until terminated by either you or Hasbro. You may terminate this Agreement at any time by no longer using this web site, provided that all prior uses of this web site shall be governed by this Agreement. Hasbro may terminate this Agreement at any time and without notice, and accordingly deny you access to this web site, in Hasbro's sole discretion for any reason, including your failure to comply with any term or provision of this Agreement. Upon any termination of this Agreement by either you or Hasbro, you must promptly destroy all materials downloaded or otherwise obtained from this web site, as well as all copies of such materials, whether made under the terms of this Agreement or otherwise.", "size": 14840000}], "name": "#Hasbro", "size": 140000}]}, {"name": "computing and information technology - software", "children": [{"children": [{"tags": ["some", "dummy", "tags"], "summary": ["The browser (or proxy) sent a request that this server could not understand."], "name": "All materials, including without limitation, annual reports to shareholders, press releases and Hasbro filings with the Securities and Exchange Commission (the \"SEC\") reproduced on this site speak as of the original date of publication or filing. The fact that a document is available on this site does not mean that the information contained in such document has not been modified or superseded by events or by a subsequent document or filing. Any forward-looking statement reproduced on this site speaks as of the original date the document containing such statement was published or filed and should be read together with certain factors set forth in the Company's Annual Report on Form 10-K under the heading \"Forward-Looking Statements\", the Company's Quarterly Reports on Form 10-Q under the heading \"Other Information\" and in other Hasbro filings with the SEC available on this site or on the SEC's Edgar Database (http:/www.sec.gov/edgarhp.htm) that could cause actual future events or results to differ materially from anticipated events or results. Hasbro has no duty or policy to update any information or statements contained on this site and, therefore, such information or statements should not be relied upon as being current as of the date you access this site. Moreover, any portion of the materials available on this site may include technical inaccuracies or typographical errors. Changes may be made from time to time without notice to the materials available on this site, the Software and to the products described on this site.", "size": 31000000}], "name": "#USSecuritiesAndExchangeCommission", "size": 680000}]}, {"name": "defence - national security", "children": [{"children": [{"tags": ["some", "dummy", "tags"], "summary": ["You agree not to submit any personal information (other than your email address or user name) through email sent to other users or messages posted on this site by you.", "You agree that no comments submitted by you to this web site will: (i) violate any right of any third party, including copyright, trademark, privacy or other personal or proprietary rights; (ii) be or contain libelous or otherwise unlawful, abusive, or obscene material or constitute the misappropriation of the trade secrets of any third party; and (iii) disparage the products or services of any third party."], "name": "You are solely responsible for the content of any comments you make. You agree that no comments submitted by you to this web site will: (i) violate any right of any third party, including copyright, trademark, privacy or other personal or proprietary rights; (ii) be or contain libelous or otherwise unlawful, abusive, or obscene material or constitute the misappropriation of the trade secrets of any third party; and (iii) disparage the products or services of any third party. You agree not to submit any personal information (other than your email address or user name) through email sent to other users or messages posted on this site by you.", "size": 12940000}], "name": "#TradeSecret", "size": 240000}]}], "name": "http://www.hasbro.com/en-us/terms", "size": 660000}