{"children": [{"name": "science and technology - technology (general)", "children": [{"children": [{"tags": ["#CloudBook", "#Sturmabteilung", "#SA", "#US", "#UnitedStates", "#Everex"], "summary": ["The browser (or proxy) sent a request that this server could not understand."], "name": "In 2012 nivio was reported as about to announce devices called Cloudbook and CloudPC to provide access to its services.21 Although the US Patent and Trademark Office shows a Cloudbook trademark with an application date of December 2009 to nHoldings doing business as \"nivio\",22 a product from Everex had been marketed as a CloudBook around 2008.23 The registration for nHoldings SA gives a location in Mont-sur-Lausanne, formerly using the name SMX iNet Global Services SA.24", "size": 9500000}], "name": "#CloudBook", "size": 200000}, {"children": [{"tags": ["#WorldEconomicForum", "#AdvancedMicroDevices", "#SA", "#Sturmabteilung"], "summary": ["Advanced Micro Devices announced an investment of undisclosed value in August 2007.6 Several patents related to the technology are assigned to SMX iNet Global Services SA, of which nivio was a subsidiary.5789 December 2008, nivio was named a technology pioneer by the World Economic Forum for its affordable computing access.1011"], "name": "Advanced Micro Devices announced an investment of undisclosed value in August 2007.6 Several patents related to the technology are assigned to SMX iNet Global Services SA, of which nivio was a subsidiary.5789 December 2008, nivio was named a technology pioneer by the World Economic Forum for its affordable computing access.1011", "size": 6580000}], "name": "#WorldEconomicForum", "size": 380000}, {"children": [{"tags": ["#ImperialCollegeLondon", "#Gurgaon", "#MicrosoftWindows", "#Switzerland", "#DeutscheBank", "#NVivo", "#CitrixSystems"], "summary": ["Sachin Dev Duggal and Saurabh Pradeep Dhoot founded nivio in 2004.1 The two founders had met as students at Imperial College London in 2000.", "Initial funding came from two executives at Deutsche Bank, where Duggal worked at the time; he claimed the idea came in 20 minutes before a presentation.2 Headquarters were in Switzerland, with a development center in Gurgaon.3 Nvivo announced a test of its first online Windows XP-based desktop service in 2007.4 Early reviews were mixed, noting that high data-rate continuous connections were needed for good response times, and existing products from companies such as Citrix Systems.5"], "name": "Sachin Dev Duggal and Saurabh Pradeep Dhoot founded nivio in 2004.1 The two founders had met as students at Imperial College London in 2000. Initial funding came from two executives at Deutsche Bank, where Duggal worked at the time; he claimed the idea came in 20 minutes before a presentation.2 Headquarters were in Switzerland, with a development center in Gurgaon.3 Nvivo announced a test of its first online Windows XP-based desktop service in 2007.4 Early reviews were mixed, noting that high data-rate continuous connections were needed for good response times, and existing products from companies such as Citrix Systems.5", "size": 12580000}], "name": "#ImperialCollegeLondon", "size": 440000}]}, {"name": "computing and information technology - software", "children": [{"children": [{"tags": ["#DesktopVirtualization", "#ApplicationSoftware"], "summary": ["Nivio was a company marketing desktop virtualization services that allow a customer to use computer application software without a personal computer."], "name": "Nivio was a company marketing desktop virtualization services that allow a customer to use computer application software without a personal computer.", "size": 2980000}], "name": "#DesktopVirtualization", "size": 440000}, {"children": [{"tags": ["#India", "#CopyrightInfringement", "#Internet", "#BhartiAirtel", "#InternetServiceProvider", "#MicrosoftOffice2007"], "summary": ["Nivio announced the nivio Companion in June 2009,12 with Bharti Airtel Limited of India as Internet service provider.", "One motivation given was rampant software piracy in India.13 The Indian media had reported on the company and its young founders since 2007.141516"], "name": "Nivio announced the nivio Companion in June 2009,12 with Bharti Airtel Limited of India as Internet service provider. Companion was a low-cost product including keyboard, mouse and a set-top-box style terminal. With a monthly service charge the user gets Internet access, Microsoft Office 2007 functionality and 10Â GBytes of storage. One motivation given was rampant software piracy in India.13 The Indian media had reported on the company and its young founders since 2007.141516", "size": 9660000}], "name": "#India", "size": 120000}, {"children": [{"tags": ["#Twitter"], "summary": ["As of 2014 the company appears to be gone; the Web site is shut down and its Twitter feed is dormant since 2013."], "name": "As of 2014 the company appears to be gone; the Web site is shut down and its Twitter feed is dormant since 2013.", "size": 2240000}], "name": "#Twitter", "size": 160000}, {"children": [{"tags": ["#GoogleDrive", "#MicrosoftOffice", "#Videocon", "#US", "#Africa", "#UnitedStates", "#ChiefOperatingOfficer", "#AEC", "#Europe", "#CollingwoodFootballClub", "#BBC", "#SiliconValley", "#SoftwareReleaseLifeCycle", "#NewDelhi", "#BBC", "#PaloAltoCalifornia", "#AssociatedEquipmentCompany", "#MiddleEast"], "summary": ["The browser (or proxy) sent a request that this server could not understand."], "name": "Videocon and AEC Partners invested US$21 million in the company in February 2012.2930 Co-founder Dhoot was a nephew of Videocon's chairman Venugopal Dhoot.29 Offices were opened in Palo Alto, California, in Silicon Valley, as well as New Delhi. In April 2012, nivio announced an application to use Microsoft Office files stored in Google Drive.31 The product received mixed reviews, since all products were still in \"by-invitation beta\" testing stages, and judged not easy to use.323334 Kate Russell of the BBC reported on the company's products in August 2012.35 Near the end of 2012, Duggal stepped down from operational roles at nivio, and Frank Houghton became the chief operating officer, as the company announced it would provide services to businesses.36 Stuart Collingwood was president for Europe, the Middle East and Africa.37", "size": 16720000}], "name": "#GoogleDrive", "size": 240000}, {"children": [{"tags": ["#MicrosoftOffice", "#OnLive", "#Microsoft", "#RemoteDesktopServices", "#RemoteDesktopProtocol"], "summary": ["The Microsoft Remote Desktop Services technology allowed nivio to be officially licensed through a service provider license agreement to use the Remote Desktop Protocol.25 This contrasts with other services such as OnLive Desktop and truCloud, which have licensing terms that have raised questions in the press.2627 The approach was also contrasted with the official support of Microsoft Office for the iPad.28"], "name": "The Microsoft Remote Desktop Services technology allowed nivio to be officially licensed through a service provider license agreement to use the Remote Desktop Protocol.25 This contrasts with other services such as OnLive Desktop and truCloud, which have licensing terms that have raised questions in the press.2627 The approach was also contrasted with the official support of Microsoft Office for the iPad.28", "size": 8200000}], "name": "#MicrosoftOffice", "size": 320000}]}, {"name": "economy, business and finance - business (general)", "children": [{"children": [{"tags": ["#Australia", "#SpringfieldQueensland", "#US", "#WorldEconomicForum", "#UnitedStates", "#NEC", "#Davos", "#CloudComputing", "#NEC", "#Polaris"], "summary": ["The browser (or proxy) sent a request that this server could not understand."], "name": "In January 2010, Duggal promoted cloud computing at the World Economic Forum at Davos.17 In February 2010 nivio announced operations in Australia, hosted by NEC at the Polaris Data Centre in Springfield, Queensland.18 By July 2010, the company estimated about US$5 million in revenues, but had not been profitable. The earlier nivio Companion product was called only a \"test\".19 By November 2010, Duggal and Dhoot claimed their goal had been education.20", "size": 9080000}], "name": "#Australia", "size": 200000}]}], "name": "Nivio - Wikipedia, the free encyclopedia", "size": 800000}