{
	"children": [
		{
			"children": [
				{
					"children": [
						{
							"name": "You may use our Services only as permitted by this Agreement and any applicable laws.  Dont misuse our Services. For example, dont interfere with our Services or try to access them using a method other than the interface and the instructions that we provide.You may discontinue your use of any Service at any time by removing the relevant code from your Properties.",
							"size": 7300000
						}
					],
					"name": "Using our Services",
					"size": 360000
				}, {
					"children": [
						{
							"name": "If you choose to implement any of the following Services on a Property, you also agree to the additional terms identified below:AdMob: the AdMob Publisher Guidelines and Policies.Custom Search Engine: the Custom Search Engine Terms of Service.",
							"size": 4860000
						}
					],
					"name": "Service-Specific Terms",
					"size": 440000
				}, {
					"children": [
						{
							"name": "Your use of the Services is subject to your creation and our approval of an AdSense account (an Account).  We have the right to refuse or limit your access to the Services. By submitting an application to use the Services, if you are an individual, you represent that you are at least 18 years of age.  You may only have one Account.By enrolling in AdSense, you permit Google to serve, as applicable, (i) advertisements and other content (Ads), (ii) Google search boxes and search results, and (iii) related search queries and other links to your websites, mobile applications, media players, mobile content, and/or other properties approved by Google (each individually a Property).  In addition, you grant Google the right to access, index and cache the Properties, or any portion thereof, including by automated means. Google may refuse to provide the Services to any Property.Any Property that is a software application and accesses our Services (a) may require preapproval by Google in writing, and (b) must comply with Googles Software Principles.",
							"size": 21060000
						}
					],
					"name": "Access to the Services; AdSense Accounts",
					"size": 800000
				}, {
					"children": [
						{
							"name": "We are constantly changing and improving our Services. We may add or remove functionalities or features of the Services at any time, and we may suspend or stop a Service altogether.We may modify the Agreement at any time. Well post any modifications to the AdSense Terms on this page and any modifications to the AdSense Program Policies or the Google Branding Guidelines on their respective pages.  Changes will not apply retroactively and generally will become effective 14 days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you dont agree to any modified terms in the Agreement, youll have to stop using the affected Services.",
							"size": 14600000
						}
					],
					"name": "Changes to our Services; Changes to the Agreement",
					"size": 980000
				}
			],
			"name": "Services",
			"size": 160000
		}, {
			"children": [
				{
					"children": [
						{
							"name": "Other than as set out expressly in the Agreement, neither party will acquire any right, title or interest in any intellectual property rights belonging to the other party or to the other partys licensors.If Google provides you with software in connection with the Services, we grant you a  non-exclusive, non-sublicensable license for use of such software.  This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by the Agreement.  Other than distributing content via the AdMob SDK, you may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  You will not remove, obscure, or alter Google's copyright notice, Brand Features, or other proprietary rights notices affixed to or contained within any Google services, software, or documentation.We grant you a non-exclusive, non-sublicensable license to use Googles trade names, trademarks, service marks, logos, domain names, and other distinctive brand features (Brand Features) solely in connection with your use of the Services and in accordance with the Agreement and the Google Branding Guidelines.  We may revoke this license at any time.  Any goodwill arising from your use of Googles Brand Features will belong to Google.We may include your name and Brand Features in our presentations, marketing materials, customer lists and financial reports.",
							"size": 31820000
						}
					],
					"name": "Intellectual Property; Brand Features",
					"size": 740000
				}, {
					"children": [
						{
							"name": "You represent and warrant that (i) you have full power and authority to enter into the Agreement; (ii) you are the owner of, or are legally authorized to act on behalf of the owner of, each Property; (iii) you are the technical and editorial decision maker in relation to each Property on which the Services are implemented and that you have control over the way in which the Services are implemented on each Property; (iv) Google has never previously terminated or otherwise disabled an AdSense account created by you due to your breach of the Agreement or due to invalid activity; (v) entering into or performing under the Agreement will not violate any agreement you have with a third party or any third-party rights; and (vi) all of the information provided by you to Google is correct and current.OTHER THAN AS EXPRESSLY SET OUT IN THE AGREEMENT, WE DO NOT MAKE ANY PROMISES ABOUT THE SERVICES.  FOR EXAMPLE, WE DONT MAKE ANY COMMITMENTS ABOUT THE CONTENT WITHIN THE SERVICES, THE SPECIFIC FUNCTION OF THE SERVICES, OR THEIR PROFITABILITY, RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE EACH SERVICE AS IS.TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES, EXPRESS, STATUTORY OR IMPLIED.  WE EXPRESSLY DISCLAIM THE WARRANTIES OR CONDITIONS OF NONINFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE.",
							"size": 26980000
						}
					],
					"name": "Representations; Warranties; Disclaimers",
					"size": 800000
				}, {
					"children": [
						{
							"name": "You agree not to disclose Google Confidential Information without our prior written consent. \"Google Confidential Information\" includes: (a) all Google software, technology and documentation relating to the Services; (b) click-through rates or other statistics relating to Property performance as pertaining to the Services; (c) the existence of, and information about, beta features in a Service; and (d) any other information made available by Google that is marked confidential or would normally be considered confidential under the circumstances in which it is presented.  Google Confidential Information does not include information that you already knew prior to your use of the Services, that becomes public through no fault of yours, that was independently developed by you, or that was lawfully given to you by a third party.  Notwithstanding this Section 9, you may accurately disclose the amount of Googles gross payments resulting from your use of the Services.",
							"size": 19460000
						}
					],
					"name": "Confidentiality",
					"size": 300000
				}, {
					"children": [
						{
							"name": "Our privacy policy explains how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policy.You will ensure that at all times you use the Services, the Properties have a clearly labeled and easily accessible privacy policy that provides end users with clear and comprehensive information about cookies, device-specific information, location information and other information stored on, accessed on, or collected from end users devices in connection with the Services, including, as applicable, information about end users options for cookie management.  You will use commercially reasonable efforts to ensure that an end user gives consent to the storing and accessing of cookies, device-specific information, location information or other information on the end user's device in connection with the Services where such consent is required by law.",
							"size": 19360000
						}
					],
					"name": "Privacy",
					"size": 140000
				}, {
					"children": [
						{
							"name": "TO THE EXTENT PERMITTED BY LAW, EXCEPT FOR ANY INDEMNIFICATION OBLIGATIONS HEREUNDER OR YOUR BREACH OF ANY INTELLECTUAL PROPERTY RIGHTS, CONFIDENTIALITY OBLIGATIONS AND/OR PROPRIETARY INTERESTS RELATING TO THE AGREEMENT, (i) IN NO EVENT SHALL EITHER PARTY BE LIABLE UNDER THE AGREEMENT FOR ANY CONSEQUENTIAL, SPECIAL, INDIRECT, EXEMPLARY, OR PUNITIVE DAMAGES WHETHER IN CONTRACT, TORT OR ANY OTHER THEORY, EVEN IF SUCH PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES AND NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY LIMITED REMEDY, AND (ii) EACH PARTYS AGGREGATE LIABILITY UNDER THE AGREEMENT IS LIMITED TO THE NET AMOUNT RECEIVED AND RETAINED BY THAT PARTICULAR PARTY IN CONNECTION WITH THIS AGREEMENT DURING THE THREE MONTH PERIOD IMMEDIATELY PRECEDING THE DATE OF THE CLAIM.  Each party acknowledges that the other party has entered into the Agreement relying on the limitations of liability stated herein and that those limitations are an essential basis of the bargain between the parties.",
							"size": 20300000
						}
					],
					"name": "Limitation of Liability",
					"size": 460000
				}
			],
			"name": "Data & Legal",
			"size": 240000
		}, {
			"children": [
				{
					"children": [
						{
							"name": "As between you and Google, Google is responsible for all taxes (if any) associated with the transactions between Google and advertisers in connection with Ads displayed on the Properties.  You are responsible for all taxes (if any) associated with the Services, other than taxes based on Googles net income.  All payments to you from Google in relation to the Services will be treated as inclusive of tax (if applicable) and will not be adjusted.",
							"size": 8920000
						}
					],
					"name": "Taxes",
					"size": 100000
				}, {
					"children": [
						{
							"name": "Subject to this Section 5 and Section 10 of these AdSense Terms, you will receive a payment related to the number of valid clicks on Ads displayed on your Properties, the number of valid impressions of Ads displayed on your Properties, or other valid events performed in connection with the display of Ads on your Properties, in each case as determined by Google.Except in the event of termination, we will pay you by the end of the calendar month following any calendar month in which the earned balance in your Account equals or exceeds the applicable payment threshold.  If you implement search Services, our payments may be offset by any applicable fees for such Services.Unless expressly authorized in writing by Google, you may not enter into any type of arrangement with a third party where that third party receives payments made to you under the Agreement or other financial benefit in relation to the Services.Payments will be calculated solely based on our accounting. Payments to you may be withheld to reflect or adjusted to exclude any amounts refunded or credited to advertisers and any amounts arising from invalid activity, as determined by Google in its sole discretion.  Invalid activity is determined by Google in all cases and includes, but is not limited to, (i) spam, invalid queries, invalid impressions or invalid clicks on Ads generated by any person, bot, automated program or similar device, including through any clicks or impressions originating from your IP addresses or computers under your control; (ii) clicks solicited or impressions generated by payment of money, false representation, or requests for end users to click on Ads or take other actions; (iii) Ads served to end users whose browsers have JavaScript disabled; and (iv) clicks or impressions co-mingled with a significant amount of the activity described in (i, ii, and iii) above.In addition to our other rights and remedies, we may (a) withhold and offset any payments owed to you under the Agreement against any fees you owe us under the Agreement or any other agreement, or (b) require you to refund us within 30 days of any invoice, any amounts we may have overpaid to you in prior periods.  If you dispute any payment made or withheld relating to the Services, you must notify Google in writing within 30 days of any such payment.  If you do not, any claim relating to the disputed payment is waived.  If an advertiser whose Ads are displayed on any Property defaults on payment to Google, we may withhold payment or charge back your account.To ensure proper payment, you are responsible for providing and maintaining accurate contact and payment information in your Account.  You are responsible for any charges assessed by your bank or payment provider.",
							"size": 55160000
						}
					],
					"name": "Payments",
					"size": 160000
				}, {
					"children": [
						{
							"name": "You agree to indemnify and defend Google, its affiliates, agents, and advertisers from and against any and all third-party claims and liabilities arising out of or related to the Properties, including any content served on the Properties that is not provided by Google, your use of the Services, or your breach of any term of the Agreement.  Googles advertisers are third-party beneficiaries of this indemnity.",
							"size": 8200000
						}
					],
					"name": "Indemnity",
					"size": 180000
				}
			],
			"name": "Financial",
			"size": 180000
		}, {
			"children": [
				{
					"children": [
						{
							"name": "Entire Agreement; Amendments.  The Agreement is our entire agreement relating to your use of the Services and supersedes any prior or contemporaneous agreements on that subject.  This Agreement may be amended (i) in a writing signed by both parties that expressly states that it is amending the Agreement, or (ii) as set forth in Section 4, if you keep using the Services after Google modifies the Agreement.Assignment.  You may not assign or transfer any of your rights under the Agreement.Independent Contractors.  The parties are independent contractors and the Agreement does not create an agency, partnership, or joint venture.No Third-Party Beneficiaries. Other than as set forth in Section 11, this Agreement does not create any third-party beneficiary rights.No Waiver.  Other than as set forth in Section 5, the failure of either party to enforce any provision of the Agreement will not constitute a waiver.Severability.  If it turns out that a particular term of the Agreement is not enforceable, the balance of the Agreement will remain in full force and effect.Survival.  Sections 7, 9, 10, 11, 13, and 14 of these AdSense Terms will survive termination.Governing Law; Venue.  All claims arising out of or relating to this Agreement or the Services will be governed by California law, excluding Californias conflict of laws rules, and will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.Force Majeure.  Neither party will be liable for inadequate performance to the extent caused by a condition (for example, natural disaster, act of war or terrorism, riot, labor condition, governmental action, and Internet disturbance) that was beyond the partys reasonable control.Communications.  In connection with your use of the Services, we may contact you regarding service announcements, administrative messages, and other information. You may opt out of some of those communications in your Account settings.  For information about how to contact Google, please visit our contact page.*              *              *",
							"size": 42800000
						}
					],
					"name": "Miscellaneous",
					"size": 260000
				}, {
					"children": [
						{
							"name": "You may terminate the Agreement at any time by completing the account cancellation process.  The Agreement will be considered terminated within 10 business days of Google's receipt of your notice.   If you terminate the Agreement and your earned balance equals or exceeds the applicable threshold, we will pay you your earned balance within approximately 90 days after the end of the calendar month in which the Agreement is terminated.  Any earned balance below the applicable threshold will remain unpaid.Google may at any time terminate the Agreement, or suspend or terminate the participation of any Property in the Services for any reason.  If we terminate the Agreement due to your breach or due to invalid activity, we may withhold unpaid amounts or charge back your account. If you breach the Agreement or Google suspends or terminates your Account, you (i) will not be allowed to create a new Account, and (ii) may not be permitted to monetize content on other Google products.",
							"size": 19720000
						}
					],
					"name": "Termination",
					"size": 220000
				}
			],
			"name": "Others",
			"size": 120000
		}
	],
	"name": "Google AdSense Online Terms of Service",
	"size": 760000
}